In [17]:
import pandas as pd
import numpy as np

In [18]:
import numpy as np
import pandas as pd
# Define the dictionary
dict1 = {
             'Name': ['Salman', 'Anwer', 'Imran'],
             'Age': [40, 30, 45],
             'Marital_Status': ['Married', 'Married', 'Married'],
             'Institute': ['NED-CCEE', 'NED-CCEE', 'NED-CCEE'],
             'Area': ['Khi-East', 'Khi-West', 'Khi South'],
}

# Create a DataFrame
df = pd.DataFrame(dict1)

# Display the DataFrame
df

     Name  Age Marital_Status Institute       Area
0  Salman   40        Married  NED-CCEE   Khi-East
1   Anwer   30        Married  NED-CCEE   Khi-West
2   Imran   45        Married  NED-CCEE  Khi South

# For Saving File in Excel/CSV format in same Folder/location

df.to_csv('friend.csv')

In [11]:
df.to_csv('friend.csv')

# for hiding/removing Index

df.to_csv('friend_index_false.csv', index=False)

In [12]:
df.to_csv('friend_index_false.csv', index=False)
df

     Name  Age Marital_Status Institute       Area
0  Salman   40        Married  NED-CCEE   Khi-East
1   Anwer   30        Married  NED-CCEE   Khi-West
2   Imran   45        Married  NED-CCEE  Khi South

In [13]:
df

     Name  Age Marital_Status Institute       Area
0  Salman   40        Married  NED-CCEE   Khi-East
1   Anwer   30        Married  NED-CCEE   Khi-West
2   Imran   45        Married  NED-CCEE  Khi South

In [14]:
df.describe

<bound method NDFrame.describe of      Name  Age Marital_Status Institute       Area
0  Salman   40        Married  NED-CCEE   Khi-East
1   Anwer   30        Married  NED-CCEE   Khi-West
2   Imran   45        Married  NED-CCEE  Khi South>

In [15]:
df.tail()

     Name  Age Marital_Status Institute       Area
0  Salman   40        Married  NED-CCEE   Khi-East
1   Anwer   30        Married  NED-CCEE   Khi-West
2   Imran   45        Married  NED-CCEE  Khi South

In [16]:
df.head(2)      #statistical analysis

     Name  Age Marital_Status Institute      Area
0  Salman   40        Married  NED-CCEE  Khi-East
1   Anwer   30        Married  NED-CCEE  Khi-West